[
  {
    "id": "id01",
    "title": "The Pragmatic Programmer: From Journeyman to Master ",
    "rating": 4.5,
    "ratings": 268,
    "image": "/images/tpp.jpg",
    "description": "The Pragmatic Programmer: From Journeyman to Master is a book about software engineering by Andrew Hunt and David Thomas, published in October, 1999. The book is the first in a series of books under the The Pragmatic Bookshelf label.",
    "published": "October 30, 1999",
    "authors": "Andy Hunt, Dave Thomas",
    "productType": "Paperback",
    "value": 35.79
  },
  {
    "id": "id02",
    "title": "Code Complete: A Practical Handbook of Software Construction",
    "rating": 4.6,
    "ratings": 232,
    "image": "/images/cc.jpg",
    "description": "Code Complete is a software development book, written by Steve McConnell and published in 2004 by Microsoft Press, urging developers to get past code and fix programming and the big design up front waterfall model.",
    "published": "June 19, 2004",
    "authors": "Steve McConnell",
    "productType": "Paperback",
    "value": 33.34
  },
  {
    "id": "id03",
    "title": "The Passionate Programmer: Creating a Remarkable Career in Software Development",
    "rating": 4.4,
    "ratings": 101,
    "image": "/images/pp.jpg",
    "description": " Success in today's IT environment requires you to view your career as a business endeavor. In this book, you'll learn how to become an entrepreneur, driving your career in the direction of your choosing.",
    "published": "June 7, 2009",
    "authors": "Chad Fowler",
    "productType": "Paperback",
    "value": 16.02
  },
  {
    "id": "id04",
    "title": "Design Patterns: Elements of Reusable Object-Oriented Software",
    "rating": 4.5,
    "ratings": 382,
    "image": "/images/dp.jpg",
    "description": " Design Patterns: Elements of Reusable Object-Oriented Software is a software engineering book describing recurring solutions to common problems in software design.",
    "published": "November 10, 1994",
    "authors": "Gang of Four",
    "productType": "Hardcover",
    "value": 45.10
  },
  {
    "id": "id05",
    "title": "TCP/IP Illustrated: The Implementation",
    "rating": 4.0,
    "ratings": 119,
    "image": "/images/tcpip.jpg",
    "description": "TCP/IP Illustrated is a complete and detailed guide to the entire TCP/IP protocol suite-with an important difference from other books on the subject",
    "published": "Feb 10, 1995",
    "authors": "W. Richard Stevens",
    "productType": "Hardcover",
    "value": 69.71
  },
  {
    "id": "id06",
    "title": "Introduction to Algorithms",
    "rating": 4.3,
    "ratings": 193,
    "image": "/images/itg.jpg",
    "description": "Introduction to Algorithms, the 'bible' of the field, is a comprehensive textbook covering the full spectrum of modern algorithms: from the fastest algorithms and data structures to polynomial-time algorithms for seemingly intractable problems, from classical algorithms in graph theory to special algorithms for string matching, computational geometry, and number theory. The revised third edition notably adds a chapter on van Emde Boas trees, one of the most useful data structures, and on multithreaded algorithms, a topic of increasing importance.",
    "published": "Jul 31, 2009",
    "authors": "Thomas, Cormen, Charles, Leiserson",
    "productType": "Hardcover",
    "value": 78.30
  },
  {
    "id": "id07",
    "title": "Code: The Hidden Language of Computer Hardware and Software",
    "rating": 4.7,
    "ratings": 216,
    "image": "/images/co.jpg",
    "description": "Code:It's a carefully written, carefully researched gem that will appeal to anyone who wants to understand computer technology at its most essential levels.",
    "published": "October 21, 2000",
    "authors": "Charles petzold",
    "productType": "Paperback",
    "value": 11.77
  },
  {
    "id": "id08",
    "title": "Continuous Delivery: Reliable Software Releases Through Build, Test, and Deployment Automation",
    "rating": 4.4,
    "ratings":61,
    "image": "/images/cd.jpg",
    "description": "Getting software released to users is often a painful, risky, and time-consuming process.This groundbreaking new book sets out the principles and technical practices that enable rapid, incremental delivery of high quality, valuable new functionality to users. Through automation of the build, deployment, and testing process, and improved collaboration between developers, testers, and operations, delivery teams can get changes released in a matter of hours sometimes even minutes-no matter what the size of a project or the complexity of its code base.",
    "published": "Aug 6, 2010",
    "authors": "Jez Humble , David Farley",
    "productType": "Hardcover",
    "value": 42.67
  },
  {
    "id": "id09",
    "title": "Algorithmics: The Spirit of Computing",
    "rating": 4.1,
    "ratings": 10,
    "image": "/images/algo.jpg",
    "description": "The best selling 'Algorithmics' presents the most important, concepts, methods and results that are fundamental to the science of computing,This book tells the story of the concepts, ideas, methods and results fundamental to computer science, in a form independent of the details of specific computers, languages and formalisms. It concerns the true 'spirit' of computers; with the 'recipes' that make them tick - their algorithms.",
    "published": "June 11, 2004",
    "authors": " David Harel and Yishai Feldman",
    "productType": "Paperback",
    "value": 100.00
  },
  {
    "id": "id10",
    "title": "Mathematics for Computer Graphics",
    "rating": 3.8,
    "ratings": 4,
    "image": "/images/mcg.jpg",
    "description": "John Vince explains a wide range of mathematical techniques and problem-solving strategies associated with computer games, computer animation, virtual reality, CAD, and other areas of computer graphics. Covering all the mathematical techniques required to resolve geometric problems and design computer programs for computer graphic applications, each chapter explores a specific mathematical topic prior to moving forward into the more advanced areas of matrix transforms, 3D curves and surface patches. Problem-solving techniques using vector analysis and geometric algebra are also discussed.",
    "published": "December 8, 2013",
    "authors": "John Vince",
    "productType": "Paperback",
    "value": 47.99 
  },
  {
    "id": "id11",
    "title": "Introduction to Linear Algebra",
    "rating": 3.6,
    "ratings": 67,
    "image": "/images/la.jpg",
    "description": "This leading textbook for first courses in linear algebra comes from the hugely experienced MIT lecturer and author Gilbert Strang",
    "published": "February 10, 2009",
    "authors": "Gilbert Strang",
    "productType": "Hardcover",
    "value": 67.24
  },
  {
    "id": "id12",
    "title": "Data Visualization: Principles and Practice",
    "rating": 5,
    "ratings": 1,
    "image": "/images/dv.jpg",
    "description": "Data visualization specialists use math, computer science and physics to create images that improve understanding of data sets, and this introductory text, ",
    "published": " 10 Feb 2009",
    "authors": "Alexandru C. Telea",
    "productType": "Hardcover",
    "value": 77.82
  }
]